Assessment3/performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 3
      arrivalRate: 1
      name: "Phase 1"
    ##- duration: 20
      ##arrivalRate: 5
      ##name: "Phase 2"  
    ##- duration: 60
      ##arrivalRate: 10
      ##name: "Phase 3"  
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json   
  ##processor: "./myProcessor.js"
scenarios:
    - flow: 
        - post:
            url: "/rest/v1/projects"
            json:
              name: "Test project"
            capture:
              json: "$.id"
              as: "projId"
        - log: "Current Project id is {{ projId }}"
        - get:
            url: "/rest/v1/tasks"  
        - post:
            url: "/rest/v1/tasks"
            json:
              content: "Demo task"
              project_id: "{{ projId }}"
            capture:
              json: "$.id"
              as: "taskId"
        - log: "Current Task id is {{ taskId }}"
        - get:
            url: "/rest/v1/tasks/{{ taskId }}"  
        - post:
            url: "/rest/v1/tasks/{{ taskId }}"
            json:
              content: "Updated task"
        - post:
            url: "/rest/v1/tasks/{{ taskId }}/close" 
        - post:
            url: "/rest/v1/tasks/{{ taskId }}/reopen"           
        - delete:
            url: "/rest/v1/tasks/{{ taskId }}"
        - delete:
            url: "/rest/v1/projects/{{ projId }}"                  
  # For more information: https://artillery.io/docs/script-reference/